## Plan Result (ithc_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 4 to change, 5 to destroy.</code></pre>

* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sptribs-dss-update-case-web&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["sptribs-dss-update-case-web"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      ~ expiration_date          = "2024-02-26T12:34:30.1790903+00:00" -> (known after apply)
      ~ host_name                = "sptribs-dss-update-case-web.ithc.platform.hmcts.net" -> "update.sptribs-frontend.ithc.platform.hmcts.net" # forces replacement
      ~ id                       = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/customDomains/sptribs-dss-update-case-web" -> (known after apply)
        name                     = "sptribs-dss-update-case-web"
      ~ validation_token         = "n8dhj1lqz987q2gspqphj2psqvgqjlrk" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/secrets/0--5d228cf0-b031-485e-96ff-157fee26d0cd-sptribs-dss-update-case-web-ithc-platform-hmcts-net" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["sptribs-dss-update-case-web"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/customDomains/sptribs-dss-update-case-web" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/associations/sptribs-dss-update-case-web" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["sptribs-dss-update-case-web"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/customDomains/sptribs-dss-update-case-web" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/associations/sptribs-dss-update-case-web" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["sptribs-dss-update-case-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
        id                             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/originGroups/sptribs-dss-update-case-web/origins/sptribs-dss-update-case-web"
        name                           = "sptribs-dss-update-case-web"
      ~ origin_host_header             = "sptribs-dss-update-case-web.ithc.platform.hmcts.net" -> "update.sptribs-frontend.ithc.platform.hmcts.net"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["sptribs-dss-update-case-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/customDomains/sptribs-dss-update-case-web",
        ] -> (known after apply)
        id                              = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/afdEndpoints/hmcts-ithc/routes/sptribs-dss-update-case-web"
        name                            = "sptribs-dss-update-case-web"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["sptribs-dss-update-case-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/customDomains/sptribs-dss-update-case-web",
        ] -> (known after apply)
        id                              = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/afdEndpoints/hmcts-ithc/routes/sptribs-dss-update-case-webHttpsRedirect"
        name                            = "sptribs-dss-update-case-webHttpsRedirect"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["sptribs-dss-update-case-web"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      ~ id                       = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/securityPolicies/sptribsdssupdatecasewebithcPremium-securityPolicy" -> (known after apply)
        name                     = "sptribsdssupdatecasewebithcPremium-securityPolicy"
        # (1 unchanged attribute hidden)

      ~ security_policies {
          ~ firewall {
                # (1 unchanged attribute hidden)

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = true -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc/customDomains/sptribs-dss-update-case-web" # forces replacement -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sptribs-dss-update-case-web"] must be replaced
-/+ resource "azurerm_dns_txt_record" "public_dns_record" {
      ~ fqdn                = "_dnsauth.sptribs-dss-update-case-web.ithc.platform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/ithc.platform.hmcts.net/TXT/_dnsauth.sptribs-dss-update-case-web" -> (known after apply)
      ~ name                = "_dnsauth.sptribs-dss-update-case-web" -> "_dnsauth.update.sptribs-frontend" # forces replacement
      - tags                = {} -> null
        # (3 unchanged attributes hidden)

      - record {
          - value = "n8dhj1lqz987q2gspqphj2psqvgqjlrk" -> null
        }
      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/hmcts-ithc|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 4 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2105,"Program":"tfcmt","SHA1":"","Target":"ithc_global","Vars":{}} -->